#pragma once

/**
 * Name: Stalker2
 * Version: 0.3
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * DelegateFunction Stalker2.Obj.OnObjTurnedToTarget__DelegateSignature
	 */
	struct AObj_OnObjTurnedToTarget__DelegateSignature_Params
	{
	public:
		bool                                                       bSuccess;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.Obj.AimTimelineFinished
	 */
	struct AObj_AimTimelineFinished_Params
	{	};

	/**
	 * Function Stalker2.ALifeSpawnLocationRandom.GenerateSpawnLocation
	 */
	struct AALifeSpawnLocationRandom_GenerateSpawnLocation_Params
	{	};

	/**
	 * Function Stalker2.WidgetBase.UpdateWidget
	 */
	struct UWidgetBase_UpdateWidget_Params
	{	};

	/**
	 * Function Stalker2.WidgetBase.DestructClearWidget
	 */
	struct UWidgetBase_DestructClearWidget_Params
	{	};

	/**
	 * Function Stalker2.AnimNotify_PlayInteractablesFX.GetAvailableBones
	 */
	struct UAnimNotify_PlayInteractablesFX_GetAvailableBones_Params
	{
	public:
		TArray<class FString>                                      ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.Anomaly.OnRechargeStateStarted
	 */
	struct AAnomaly_OnRechargeStateStarted_Params
	{	};

	/**
	 * Function Stalker2.Anomaly.OnIdleStateStarted
	 */
	struct AAnomaly_OnIdleStateStarted_Params
	{	};

	/**
	 * Function Stalker2.Anomaly.OnEndOverlap
	 */
	struct AAnomaly_OnEndOverlap_Params
	{
	public:
		class UPrimitiveComponent*                                 OverlappedComponent;                                     // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              OtherActor;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UPrimitiveComponent*                                 OtherComp;                                               // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    OtherBodyIndex;                                          // 0x0018(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.Anomaly.OnBeginOverlap
	 */
	struct AAnomaly_OnBeginOverlap_Params
	{
	public:
		class UPrimitiveComponent*                                 OverlappedComponent;                                     // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              OtherActor;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UPrimitiveComponent*                                 OtherComp;                                               // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    OtherBodyIndex;                                          // 0x0018(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bFromSweep;                                              // 0x001C(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_E3G9[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FHitResult                                          SweepResult;                                             // 0x0020(0x00E8)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.Anomaly.OnActiveStateStarted
	 */
	struct AAnomaly_OnActiveStateStarted_Params
	{	};

	/**
	 * Function Stalker2.Anomaly.OnActivationStateStarted
	 */
	struct AAnomaly_OnActivationStateStarted_Params
	{	};

	/**
	 * Function Stalker2.Anomaly.ForceDeactivate
	 */
	struct AAnomaly_ForceDeactivate_Params
	{	};

	/**
	 * Function Stalker2.Anomaly.ForceActivateOnce
	 */
	struct AAnomaly_ForceActivateOnce_Params
	{	};

	/**
	 * Function Stalker2.Anomaly.ForceActivateEndless
	 */
	struct AAnomaly_ForceActivateEndless_Params
	{	};

	/**
	 * Function Stalker2.UIDActorComponent.GetGUID
	 */
	struct UUIDActorComponent_GetGUID_Params
	{
	public:
		struct FGuid                                               ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.InteractionComponent.SetInteractionActive
	 */
	struct UInteractionComponent_SetInteractionActive_Params
	{
	public:
		bool                                                       bActive;                                                 // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.BarbedWireComponent.OnOverlapEnd
	 */
	struct UBarbedWireComponent_OnOverlapEnd_Params
	{
	public:
		class UPrimitiveComponent*                                 OverlappedComponent;                                     // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              OtherActor;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UPrimitiveComponent*                                 OtherComp;                                               // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    OtherBodyIndex;                                          // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.BarbedWireComponent.OnOverlapBegin
	 */
	struct UBarbedWireComponent_OnOverlapBegin_Params
	{
	public:
		class UPrimitiveComponent*                                 OverlapComponent;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              OtherActor;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UPrimitiveComponent*                                 OtherComp;                                               // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    OtherBodyIndex;                                          // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bFromSweep;                                              // 0x001C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_NIC3[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FHitResult                                          SweepResult;                                             // 0x0020(0x00E8)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.BarbedWireComponent.OnCompHit
	 */
	struct UBarbedWireComponent_OnCompHit_Params
	{
	public:
		class UPrimitiveComponent*                                 HitComp;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              OtherActor;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UPrimitiveComponent*                                 OtherComp;                                               // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             NormalImpulse;                                           // 0x0018(0x0018)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FHitResult                                          Hit;                                                     // 0x0030(0x00E8)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.BaseInteractableAction.RunAlternativeAction
	 */
	struct UBaseInteractableAction_RunAlternativeAction_Params
	{	};

	/**
	 * Function Stalker2.BaseInteractableAction.RunAction
	 */
	struct UBaseInteractableAction_RunAction_Params
	{	};

	/**
	 * Function Stalker2.BaseInteractableAction.CanInteract
	 */
	struct UBaseInteractableAction_CanInteract_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.BedView.Interact
	 */
	struct ABedView_Interact_Params
	{	};

	/**
	 * Function Stalker2.Bolt.OnComponentHit
	 */
	struct ABolt_OnComponentHit_Params
	{
	public:
		class UPrimitiveComponent*                                 HitComponent;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              OtherActor;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UPrimitiveComponent*                                 OtherComp;                                               // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             NormalImpulse;                                           // 0x0018(0x0018)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FHitResult                                          Hit;                                                     // 0x0030(0x00E8)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.ViewBase.UIClose
	 */
	struct UViewBase_UIClose_Params
	{	};

	/**
	 * Function Stalker2.ViewBase.PreCloseUpdateView
	 */
	struct UViewBase_PreCloseUpdateView_Params
	{	};

	/**
	 * Function Stalker2.BookViewBase.ClickMenuButton
	 */
	struct UBookViewBase_ClickMenuButton_Params
	{
	public:
		int32_t                                                    InButtonIndex;                                           // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.BookViewBase.ChangeSelectButton
	 */
	struct UBookViewBase_ChangeSelectButton_Params
	{	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.WidgetIsChildOf
	 */
	struct UVictoryBPFunctionLibrary_WidgetIsChildOf_Params
	{
	public:
		class UWidget*                                             ChildWidget;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UWidget*                                             PossibleParent;                                          // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.WidgetGetParentOfClass
	 */
	struct UVictoryBPFunctionLibrary_WidgetGetParentOfClass_Params
	{
	public:
		class UWidget*                                             ChildWidget;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UClass*                                              WidgetClass;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UUserWidget*                                         ReturnValue;                                             // 0x0010(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.Viewport__GetCenterOfViewport
	 */
	struct UVictoryBPFunctionLibrary_Viewport__GetCenterOfViewport_Params
	{
	public:
		class APlayerController*                                   ThePC;                                                   // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      PosX;                                                    // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      PosY;                                                    // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.VictorySoundVolumeChange
	 */
	struct UVictoryBPFunctionLibrary_VictorySoundVolumeChange_Params
	{
	public:
		class USoundClass*                                         SoundClassObject;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      NewVolume;                                               // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.VictoryRemoveAxisKeyBind
	 */
	struct UVictoryBPFunctionLibrary_VictoryRemoveAxisKeyBind_Params
	{
	public:
		struct FVictoryInputAxis                                   ToRemove;                                                // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.VictoryRemoveActionKeyBind
	 */
	struct UVictoryBPFunctionLibrary_VictoryRemoveActionKeyBind_Params
	{
	public:
		struct FVictoryInput                                       ToRemove;                                                // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.VictoryReBindAxisKey
	 */
	struct UVictoryBPFunctionLibrary_VictoryReBindAxisKey_Params
	{
	public:
		struct FVictoryInputAxis                                   Original;                                                // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
		struct FVictoryInputAxis                                   NewBinding;                                              // 0x0040(0x0040)  (Parm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0080(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.VictoryReBindActionKey
	 */
	struct UVictoryBPFunctionLibrary_VictoryReBindActionKey_Params
	{
	public:
		struct FVictoryInput                                       Original;                                                // 0x0000(0x0040)  (Parm, NativeAccessSpecifierPublic)
		struct FVictoryInput                                       NewBinding;                                              // 0x0040(0x0040)  (Parm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0080(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.VictoryPaths__ScreenShotsDir
	 */
	struct UVictoryBPFunctionLibrary_VictoryPaths__ScreenShotsDir_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.VictoryPaths__SavedDir
	 */
	struct UVictoryBPFunctionLibrary_VictoryPaths__SavedDir_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.VictoryGetVictoryInputAxis
	 */
	struct UVictoryBPFunctionLibrary_VictoryGetVictoryInputAxis_Params
	{
	public:
		struct FKeyEvent                                           KeyEvent;                                                // 0x0000(0x0038)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		struct FVictoryInputAxis                                   ReturnValue;                                             // 0x0038(0x0040)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.VictoryGetVictoryInput
	 */
	struct UVictoryBPFunctionLibrary_VictoryGetVictoryInput_Params
	{
	public:
		struct FKeyEvent                                           KeyEvent;                                                // 0x0000(0x0038)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		struct FVictoryInput                                       ReturnValue;                                             // 0x0038(0x0040)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.VictoryGetAllAxisKeyBindings
	 */
	struct UVictoryBPFunctionLibrary_VictoryGetAllAxisKeyBindings_Params
	{
	public:
		TArray<struct FVictoryInputAxis>                           Bindings;                                                // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.VictoryGetAllAxisAndActionMappingsForKey
	 */
	struct UVictoryBPFunctionLibrary_VictoryGetAllAxisAndActionMappingsForKey_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<struct FVictoryInput>                               ActionBindings;                                          // 0x0018(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		TArray<struct FVictoryInputAxis>                           AxisBindings;                                            // 0x0028(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.VictoryGetAllActionKeyBindings
	 */
	struct UVictoryBPFunctionLibrary_VictoryGetAllActionKeyBindings_Params
	{
	public:
		TArray<struct FVictoryInput>                               Bindings;                                                // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.ScreenShots_Rename_Move_Most_Recent
	 */
	struct UVictoryBPFunctionLibrary_ScreenShots_Rename_Move_Most_Recent_Params
	{
	public:
		class FString                                              OriginalFileName;                                        // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              NewName;                                                 // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              NewAbsoluteFolderPath;                                   // 0x0020(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       HighResolution;                                          // 0x0030(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0031(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.SaveGameObject_GetAllSaveSlotFileNames
	 */
	struct UVictoryBPFunctionLibrary_SaveGameObject_GetAllSaveSlotFileNames_Params
	{
	public:
		TArray<class FString>                                      FileNames;                                               // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.SaveConfigToFile
	 */
	struct UVictoryBPFunctionLibrary_SaveConfigToFile_Params
	{
	public:
		TArray<struct FVictoryInput>                               VictoryInputs;                                           // 0x0000(0x0010)  (Parm, ZeroConstructor, NativeAccessSpecifierPublic)
		class FString                                              Filename;                                                // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.RemoveAllWidgetsOfClass
	 */
	struct UVictoryBPFunctionLibrary_RemoveAllWidgetsOfClass_Params
	{
	public:
		class UObject*                                             WorldContextObject;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UClass*                                              WidgetClass;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.MapRangeClamped
	 */
	struct UVictoryBPFunctionLibrary_MapRangeClamped_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      InRangeA;                                                // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      InRangeB;                                                // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      OutRangeA;                                               // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      OutRangeB;                                               // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0014(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.LoadObjectFromAssetPath
	 */
	struct UVictoryBPFunctionLibrary_LoadObjectFromAssetPath_Params
	{
	public:
		class UClass*                                              ObjectClass;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                Path;                                                    // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       IsValid;                                                 // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_S187[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UObject*                                             ReturnValue;                                             // 0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.IsWidgetOfClassInViewport
	 */
	struct UVictoryBPFunctionLibrary_IsWidgetOfClassInViewport_Params
	{
	public:
		class UObject*                                             WorldContextObject;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UClass*                                              WidgetClass;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.GetObjectPath
	 */
	struct UVictoryBPFunctionLibrary_GetObjectPath_Params
	{
	public:
		class UObject*                                             Obj;                                                     // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.GetFirstWidgetOfClass
	 */
	struct UVictoryBPFunctionLibrary_GetFirstWidgetOfClass_Params
	{
	public:
		class UObject*                                             WorldContextObject;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UClass*                                              WidgetClass;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       TopLevelOnly;                                            // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_NCFB[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UUserWidget*                                         ReturnValue;                                             // 0x0018(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.VictoryBPFunctionLibrary.GetAllWidgetsOfClass
	 */
	struct UVictoryBPFunctionLibrary_GetAllWidgetsOfClass_Params
	{
	public:
		class UObject*                                             WorldContextObject;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UClass*                                              WidgetClass;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		TArray<class UUserWidget*>                                 FoundWidgets;                                            // 0x0010(0x0010)  (Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		bool                                                       TopLevelOnly;                                            // 0x0020(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.ButtonBase.ButtonClicked
	 */
	struct UButtonBase_ButtonClicked_Params
	{	};

	/**
	 * Function Stalker2.ChangeWidgetSwitcher.PreDestructUpdate
	 */
	struct UChangeWidgetSwitcher_PreDestructUpdate_Params
	{	};

	/**
	 * Function Stalker2.ChangeWidgetSwitcher.PreConstructUpdate
	 */
	struct UChangeWidgetSwitcher_PreConstructUpdate_Params
	{	};

	/**
	 * Function Stalker2.CheckBoxWidget.SetChecked
	 */
	struct UCheckBoxWidget_SetChecked_Params
	{
	public:
		bool                                                       bInChecked;                                              // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bBrodcastOnChangeCheck;                                  // 0x0001(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CheckBoxWidget.GetChecked
	 */
	struct UCheckBoxWidget_GetChecked_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.ChemicalAnomaly.OnDecalSpawn
	 */
	struct AChemicalAnomaly_OnDecalSpawn_Params
	{	};

	/**
	 * Function Stalker2.CinematicDelegateToken.OnCinematicStopped
	 */
	struct UCinematicDelegateToken_OnCinematicStopped_Params
	{	};

	/**
	 * Function Stalker2.CinematicDelegateToken.OnCinematicStarted
	 */
	struct UCinematicDelegateToken_OnCinematicStarted_Params
	{	};

	/**
	 * Function Stalker2.CinematicManager.OnFadeScreenEnd
	 */
	struct UCinematicManager_OnFadeScreenEnd_Params
	{
	public:
		bool                                                       bFadeOut;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_ZUO8[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FLinearColor                                        FadeTargetColor;                                         // 0x0004(0x0010)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      FadeAmount;                                              // 0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      FadeTime;                                                // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.ClassicFireAnomaly.OnStateChanged
	 */
	struct AClassicFireAnomaly_OnStateChanged_Params
	{	};

	/**
	 * Function Stalker2.ClickerAnomaly.OnBeginParticleOverlap
	 */
	struct AClickerAnomaly_OnBeginParticleOverlap_Params
	{
	public:
		class UPrimitiveComponent*                                 OverlappedComponent;                                     // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              OtherActor;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UPrimitiveComponent*                                 OtherComp;                                               // 0x0010(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    OtherBodyIndex;                                          // 0x0018(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bFromSweep;                                              // 0x001C(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_TSGT[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FHitResult                                          SweepResult;                                             // 0x0020(0x00E8)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.InteractableComponent.SetEnabled
	 */
	struct UInteractableComponent_SetEnabled_Params
	{
	public:
		bool                                                       bInEnabled;                                              // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.InteractableComponent.SetDisplayPriority
	 */
	struct UInteractableComponent_SetDisplayPriority_Params
	{
	public:
		EDisplayPriority                                           NewPriority;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.InteractableComponent.GetPreventDefaultInteract
	 */
	struct UInteractableComponent_GetPreventDefaultInteract_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.InteractableComponent.GetInteractionType
	 */
	struct UInteractableComponent_GetInteractionType_Params
	{
	public:
		EInteractionType                                           ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.InteractableComponent.GetDisplayPriority
	 */
	struct UInteractableComponent_GetDisplayPriority_Params
	{
	public:
		EDisplayPriority                                           ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.HintBase.UpdateHintWidget
	 */
	struct UHintBase_UpdateHintWidget_Params
	{	};

	/**
	 * Function Stalker2.HintBase.SetText
	 */
	struct UHintBase_SetText_Params
	{
	public:
		class FText                                                InText;                                                  // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.HintBase.SetStylePrefix
	 */
	struct UHintBase_SetStylePrefix_Params
	{
	public:
		class FString                                              InStylePrefix;                                           // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.HintBase.PostShowHover
	 */
	struct UHintBase_PostShowHover_Params
	{
	public:
		bool                                                       bInShow;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.HintBase.HoverChangeHintTextColor
	 */
	struct UHintBase_HoverChangeHintTextColor_Params
	{
	public:
		bool                                                       bShow;                                                   // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_LPNL[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              InStylePrefix;                                           // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.HintBase.GetHoverSettings
	 */
	struct UHintBase_GetHoverSettings_Params
	{
	public:
		TArray<struct FHoverAction>                                ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CompassWidget.ToggleOpacityState
	 */
	struct UCompassWidget_ToggleOpacityState_Params
	{
	public:
		EOpasityState                                              InOpasityState;                                          // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EPreviousStateMode                                         InPreviousStateMode;                                     // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bPlayForward;                                            // 0x0002(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CompassWidget.GetCompassCenterBorders
	 */
	struct UCompassWidget_GetCompassCenterBorders_Params
	{
	public:
		bool                                                       bIsRightBorder;                                          // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_RFM5[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.ContextualNavLinkProxy.OnStartUsingCustomLink
	 */
	struct AContextualNavLinkProxy_OnStartUsingCustomLink_Params
	{
	public:
		class AActor*                                              MovingActor;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             DestinationPoint;                                        // 0x0008(0x0018)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.UIManagerOnQuestDeselected
	 */
	struct UCppMediator_UIManagerOnQuestDeselected_Params
	{
	public:
		int32_t                                                    PrototypeID;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.UIManagerGenerateAndGetDefaultNameSave
	 */
	struct UCppMediator_UIManagerGenerateAndGetDefaultNameSave_Params
	{
	public:
		class FString                                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SpawnTriplanarDecalAtLocation
	 */
	struct UCppMediator_SpawnTriplanarDecalAtLocation_Params
	{
	public:
		class UObject*                                             WorldContextObject;                                      // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UMaterialInterface*                                  DecalMaterial;                                           // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             DecalSize;                                               // 0x0010(0x0018)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             Location;                                                // 0x0028(0x0018)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FRotator                                            Rotation;                                                // 0x0040(0x0018)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		float                                                      LifeSpan;                                                // 0x0058(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_H94M[0x4];                                   // 0x005C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UTriplanarDecalComponent*                            ReturnValue;                                             // 0x0060(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.ShouldUpdateSolarTime
	 */
	struct UCppMediator_ShouldUpdateSolarTime_Params
	{
	public:
		float                                                      PrevSolarTime;                                           // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      SolarTime;                                               // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      UpdateSunDeltaTime;                                      // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SetVoiceVolume
	 */
	struct UCppMediator_SetVoiceVolume_Params
	{
	public:
		float                                                      InVoiceVolume;                                           // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SetTurnOnVoiceVolume
	 */
	struct UCppMediator_SetTurnOnVoiceVolume_Params
	{
	public:
		bool                                                       bInTurnOnVoiceVolume;                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SetTurnOnMutantsVolume
	 */
	struct UCppMediator_SetTurnOnMutantsVolume_Params
	{
	public:
		bool                                                       bInTurnOnMutantsVolume;                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SetTurnOnMusicVolume
	 */
	struct UCppMediator_SetTurnOnMusicVolume_Params
	{
	public:
		bool                                                       bInTurnOnMusicVolume;                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SetTurnOnAllVolume
	 */
	struct UCppMediator_SetTurnOnAllVolume_Params
	{
	public:
		bool                                                       bInTurnOnAllVolume;                                      // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SettingsManagerRestoreCachedSettings
	 */
	struct UCppMediator_SettingsManagerRestoreCachedSettings_Params
	{	};

	/**
	 * Function Stalker2.CppMediator.SettingsManagerCacheCurrentSettings
	 */
	struct UCppMediator_SettingsManagerCacheCurrentSettings_Params
	{	};

	/**
	 * Function Stalker2.CppMediator.SettingsManagerApplySettings
	 */
	struct UCppMediator_SettingsManagerApplySettings_Params
	{	};

	/**
	 * Function Stalker2.CppMediator.SetSelectedLanguage
	 */
	struct UCppMediator_SetSelectedLanguage_Params
	{
	public:
		ELocalizationLanguage                                      InSelectedLanguage;                                      // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SetMutantsVolume
	 */
	struct UCppMediator_SetMutantsVolume_Params
	{
	public:
		float                                                      InMutantsVolume;                                         // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SetMusicVolume
	 */
	struct UCppMediator_SetMusicVolume_Params
	{
	public:
		float                                                      InMusicVolume;                                           // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SetMouseSensitivityCoef
	 */
	struct UCppMediator_SetMouseSensitivityCoef_Params
	{
	public:
		float                                                      InMouseSensitivityCoef;                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SetMeshNaniteSettings
	 */
	struct UCppMediator_SetMeshNaniteSettings_Params
	{
	public:
		class UStaticMesh*                                         Mesh;                                                    // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bEnable;                                                 // 0x0008(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SetAudiologPlaybackPercent
	 */
	struct UCppMediator_SetAudiologPlaybackPercent_Params
	{
	public:
		float                                                      PlaybackPercent;                                         // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SetAllVolume
	 */
	struct UCppMediator_SetAllVolume_Params
	{
	public:
		float                                                      InVolume;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SetAimMouseSensitivityCoef
	 */
	struct UCppMediator_SetAimMouseSensitivityCoef_Params
	{
	public:
		float                                                      InAimMouseSensitivityCoef;                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.SaveCharacter
	 */
	struct UCppMediator_SaveCharacter_Params
	{
	public:
		class FString                                              CharacterSID;                                            // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UMeshGeneratorEditor*                                MeshGenerator;                                           // 0x0010(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bSaveObj;                                                // 0x0018(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_4DG7[0x7];                                   // 0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              SaveObjConfigPath;                                       // 0x0020(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.RuntimeGetWorld
	 */
	struct UCppMediator_RuntimeGetWorld_Params
	{
	public:
		class UWorld*                                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.ResetSaveForGuidActor
	 */
	struct UCppMediator_ResetSaveForGuidActor_Params
	{
	public:
		struct FGuid                                               Guid;                                                    // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.ReloadConfigPrototypes
	 */
	struct UCppMediator_ReloadConfigPrototypes_Params
	{	};

	/**
	 * Function Stalker2.CppMediator.ReadSaveForGuidActor_Bool
	 */
	struct UCppMediator_ReadSaveForGuidActor_Bool_Params
	{
	public:
		struct FGuid                                               Guid;                                                    // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       Value;                                                   // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_RTAS[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    Seek;                                                    // 0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0018(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.QuestInteractionFinishAction
	 */
	struct UCppMediator_QuestInteractionFinishAction_Params
	{
	public:
		class UInteractableComponent*                              InteractionComponent;                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              LauncherName;                                            // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.QuestInteractionComponentFinishAction
	 */
	struct UCppMediator_QuestInteractionComponentFinishAction_Params
	{
	public:
		class UInteractionComponent*                               InteractionComponent;                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              LauncherName;                                            // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.OnToggleAudiolog
	 */
	struct UCppMediator_OnToggleAudiolog_Params
	{
	public:
		bool                                                       bPlayAudiolog;                                           // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.ObjGetHP
	 */
	struct UCppMediator_ObjGetHP_Params
	{
	public:
		class AObj*                                                Obj;                                                     // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function Stalker2.CppMediator.MusicPlaySoundCurve
	 */
	struct UCppMediator_MusicPlaySoundCurve_Params
	{
	public:
