#pragma once

/**
 * Name: Stalker2
 * Version: 0.3
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class Stalker2.ActorEyesCameraActor
	 * Size -> 0x0020 (FullSize[0x0990] - InheritedSize[0x0970])
	 */
	class AActorEyesCameraActor : public ACameraActor
	{
	public:
		unsigned char                                              UnknownData_L5I7[0x20];                                  // 0x0970(0x0020) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.ActorInteractionDataInterface
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UActorInteractionDataInterface : public UInterface
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.ModelCharacter
	 * Size -> 0x0018 (FullSize[0x0620] - InheritedSize[0x0608])
	 */
	class AModelCharacter : public ACharacter
	{
	public:
		unsigned char                                              UnknownData_RHF1[0x8];                                   // 0x0608(0x0008) Fix Super Size
		unsigned char                                              UnknownData_0MO8[0x10];                                  // 0x0610(0x0010) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.Obj
	 * Size -> 0x0110 (FullSize[0x0730] - InheritedSize[0x0620])
	 */
	class AObj : public AModelCharacter
	{
	public:
		unsigned char                                              UnknownData_SIY0[0x60];                                  // 0x0620(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UItemAppearanceComponent*                            ItemAppearanceComponent;                                 // 0x0680(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UPhysicsInteractionComponent*                        PhysicsInteractionComponent;                             // 0x0688(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_W3WU[0x8];                                   // 0x0690(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAkComponent*                                        AkAudioComponent;                                        // 0x0698(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UMovementComponentExt*                               MovementComponentExt;                                    // 0x06A0(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UPhysicalAnimationComponent*                         PhysicalAnimationComponent;                              // 0x06A8(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UHeadFlashlightComponent*                            FlashlightComponent;                                     // 0x06B0(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UTacticalFlashlightComponent*                        TacticalFlashlightComponent;                             // 0x06B8(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UAudioComponent*                                     AudioComponent;                                          // 0x06C0(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UCurveVector*                                        FallingDamageCurve;                                      // 0x06C8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UAkAudioEvent*                                       FallingDamageSound;                                      // 0x06D0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UAkSwitchValue*                                      FallingDamageEasySoundSwitch;                            // 0x06D8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UAkSwitchValue*                                      FallingDamageMediumSoundSwitch;                          // 0x06E0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UAkSwitchValue*                                      FallingDamageHighSoundSwitch;                            // 0x06E8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_XGIH[0x20];                                  // 0x06F0(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAttackComponent*                                    AttackComponent;                                         // 0x0710(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_95EL[0x18];                                  // 0x0718(0x0018) MISSED OFFSET (PADDING)

	public:
		void OnObjTurnedToTarget__DelegateSignature(bool bSuccess);
		void AimTimelineFinished();
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.Agent
	 * Size -> 0x01D8 (FullSize[0x0908] - InheritedSize[0x0730])
	 */
	class AAgent : public AObj
	{
	public:
		unsigned char                                              UnknownData_M2AC[0x148];                                 // 0x0730(0x0148) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USmoothPathFollowingComponent*                       SmoothPathFollowingComponent;                            // 0x0878(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UNPCComponent*                                       NPCComponent;                                            // 0x0880(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UWoundedHoldComponent*                               WoundedHoldComponent;                                    // 0x0888(0x0008) Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UStealthKillComponent*                               StealthKillComponent;                                    // 0x0890(0x0008) Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bTickMotion;                                             // 0x0898(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_CH40[0x6F];                                  // 0x0899(0x006F) Fix size for supers

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AICoreSubsystem
	 * Size -> 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
	 */
	class UAICoreSubsystem : public UGameInstanceSubsystem
	{
	public:
		unsigned char                                              UnknownData_PSKY[0x60];                                  // 0x0030(0x0060) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AIDebugSubsystem
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAIDebugSubsystem : public UGameInstanceSubsystem
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AIFeatureSubsystem
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class UAIFeatureSubsystem : public UGameInstanceSubsystem
	{
	public:
		unsigned char                                              UnknownData_ZRHH[0x8];                                   // 0x0030(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AirWalkCheat
	 * Size -> 0x0020 (FullSize[0x00D0] - InheritedSize[0x00B0])
	 */
	class UAirWalkCheat : public UActorComponent
	{
	public:
		float                                                      LastValidZCoordinate;                                    // 0x00B0(0x0004) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_KY9Y[0x4];                                   // 0x00B4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             WaitingForGroundSpawnAtLocation;                         // 0x00B8(0x0018) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.BaseManager
	 * Size -> 0x0038 (FullSize[0x0060] - InheritedSize[0x0028])
	 */
	class UBaseManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_MJ5J[0x38];                                  // 0x0028(0x0038) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.BaseTickableManager
	 * Size -> 0x0010 (FullSize[0x0070] - InheritedSize[0x0060])
	 */
	class UBaseTickableManager : public UBaseManager
	{
	public:
		unsigned char                                              UnknownData_83I0[0x10];                                  // 0x0060(0x0010) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.ALifeManager
	 * Size -> 0x0008 (FullSize[0x0078] - InheritedSize[0x0070])
	 */
	class UALifeManager : public UBaseTickableManager
	{
	public:
		unsigned char                                              UnknownData_Y0D7[0x8];                                   // 0x0070(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.ALifeSpawnLocation
	 * Size -> 0x0070 (FullSize[0x02F0] - InheritedSize[0x0280])
	 */
	class AALifeSpawnLocation : public AActor
	{
	public:
		struct FFactionSelectorArray                               Factions;                                                // 0x0280(0x0010) Edit, NativeAccessSpecifierPublic
		struct FFactionSelector                                    OwnerFaction;                                            // 0x0290(0x0060) Edit, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.ALifeSpawnLocationRandom
	 * Size -> 0x0028 (FullSize[0x02A8] - InheritedSize[0x0280])
	 */
	class AALifeSpawnLocationRandom : public AActor
	{
	public:
		int32_t                                                    SpawnLocationsTotalCount;                                // 0x0280(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_10H6[0x4];                                   // 0x0284(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UClass*>                                      UnitSpawnLocationsTypes;                                 // 0x0288(0x0010) Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		TArray<class AALifeSpawnLocation*>                         UnitSpawnLocations;                                      // 0x0298(0x0010) Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic

	public:
		void GenerateSpawnLocation();
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.WidgetBase
	 * Size -> 0x0000 (FullSize[0x0290] - InheritedSize[0x0290])
	 */
	class UWidgetBase : public UUserWidget
	{
	public:
		void UpdateWidget();
		void DestructClearWidget();
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.ChildViewBase
	 * Size -> 0x0008 (FullSize[0x0298] - InheritedSize[0x0290])
	 */
	class UChildViewBase : public UWidgetBase
	{
	public:
		bool                                                       bShouldAutoBindEvent;                                    // 0x0290(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6JGH[0x7];                                   // 0x0291(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AmmoWidget
	 * Size -> 0x01C0 (FullSize[0x0458] - InheritedSize[0x0298])
	 */
	class UAmmoWidget : public UChildViewBase
	{
	public:
		int32_t                                                    MinAmmoToBlockAnim;                                      // 0x0298(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KMTX[0x4];                                   // 0x029C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<EFireTypeSlotType, struct FFireTypeSlotSettings>      FireTypeSlotSettings;                                    // 0x02A0(0x0050) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		TMap<EFireType, class UTexture*>                           FireIcons;                                               // 0x02F0(0x0050) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		float                                                      AnimAmmoHideSpeed;                                       // 0x0340(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AnimAmmoShowSpeed;                                       // 0x0344(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        AnimAmmoColor;                                           // 0x0348(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTextBlock*                                          AmmoCount;                                               // 0x0358(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTextBlock*                                          AmmoCountMax;                                            // 0x0360(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTextWidget*                                         CaliberText;                                             // 0x0368(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UImage*                                              AmmoIcon;                                                // 0x0370(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UVerticalBox*                                        AmmoCounter;                                             // 0x0378(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UHorizontalBox*                                      FireTypeCounter;                                         // 0x0380(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UOverlay*                                            Divider;                                                 // 0x0388(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UImage*                                              AmmoBorder;                                              // 0x0390(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UImage*                                              AmmoBorderShadow;                                        // 0x0398(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UWidgetAnimation*                                    AnimAmmoHide;                                            // 0x03A0(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UWidgetAnimation*                                    AnimAmmoShow;                                            // 0x03A8(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TABL[0xA8];                                  // 0x03B0(0x00A8) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.PlayerWeaponAnimCollectionInterface
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UPlayerWeaponAnimCollectionInterface : public UInterface
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstanceBase
	 * Size -> 0x0080 (FullSize[0x03E8] - InheritedSize[0x0368])
	 */
	class UAnimInstanceBase : public UAnimInstance
	{
	public:
		unsigned char                                              UnknownData_83P7[0x8];                                   // 0x0368(0x0008) Fix Super Size
		unsigned char                                              UnknownData_WDE4[0x28];                                  // 0x0370(0x0028) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AObj*                                                Owner;                                                   // 0x0398(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class USkeletalMeshComponent*                              SkeletalMeshComponent;                                   // 0x03A0(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UAnimSequence*                                       DummyAnimation;                                          // 0x03A8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UClass*                                              DummyBlueprint;                                          // 0x03B0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_U44U[0x30];                                  // 0x03B8(0x0030) Fix size for supers

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstanceMutant
	 * Size -> 0x00F0 (FullSize[0x04D8] - InheritedSize[0x03E8])
	 */
	class UAnimInstanceMutant : public UAnimInstanceBase
	{
	public:
		struct FAnimLocomotionData                                 LocomotionData;                                          // 0x03E8(0x0098) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimHitData                                        HitData;                                                 // 0x0480(0x0048) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimMutantStateData                                StateData;                                               // 0x04C8(0x0007) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_4WTT[0x1];                                   // 0x04CF(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimMutantCollectionsData                          CollectionData;                                          // 0x04D0(0x0008) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstanceBlindDog
	 * Size -> 0x0388 (FullSize[0x0860] - InheritedSize[0x04D8])
	 */
	class UAnimInstanceBlindDog : public UAnimInstanceMutant
	{
	public:
		struct FFourLegIKData                                      LegsIKData;                                              // 0x04D8(0x0388) Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstanceBloodsucker
	 * Size -> 0x01A8 (FullSize[0x0680] - InheritedSize[0x04D8])
	 */
	class UAnimInstanceBloodsucker : public UAnimInstanceMutant
	{
	public:
		struct FTwoLegIKData                                       LegsIKData;                                              // 0x04D8(0x01A8) Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstanceBoar
	 * Size -> 0x0388 (FullSize[0x0860] - InheritedSize[0x04D8])
	 */
	class UAnimInstanceBoar : public UAnimInstanceMutant
	{
	public:
		struct FFourLegIKData                                      LegsIKData;                                              // 0x04D8(0x0388) Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstanceFace
	 * Size -> 0x0018 (FullSize[0x0400] - InheritedSize[0x03E8])
	 */
	class UAnimInstanceFace : public UAnimInstanceBase
	{
	public:
		struct FAnimHumanFaceData                                  FaceData;                                                // 0x03E8(0x0018) Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstanceFlesh
	 * Size -> 0x0388 (FullSize[0x0860] - InheritedSize[0x04D8])
	 */
	class UAnimInstanceFlesh : public UAnimInstanceMutant
	{
	public:
		struct FFourLegIKData                                      LegsIKData;                                              // 0x04D8(0x0388) Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstanceHuman
	 * Size -> 0x07E8 (FullSize[0x0BD0] - InheritedSize[0x03E8])
	 */
	class UAnimInstanceHuman : public UAnimInstanceBase
	{
	public:
		struct FAnimLocomotionData                                 LocomotionData;                                          // 0x03E8(0x0098) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimHumanWeaponData                                WeaponData;                                              // 0x0480(0x0010) Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected
		struct FAnimHitData                                        HitData;                                                 // 0x0490(0x0048) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimWoundedData                                    WoundedData;                                             // 0x04D8(0x0048) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimHumanCollectionsData                           CollectionsData;                                         // 0x0520(0x0018) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimHumanStateData                                 StateData;                                               // 0x0538(0x0014) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_KIL8[0x4];                                   // 0x054C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimTwoHandsIKData                                 HandsIKData;                                             // 0x0550(0x0078) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FTwoLegIKData                                       LegsIKData;                                              // 0x05C8(0x01A8) Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected
		struct FAnimHumanFaceData                                  FaceData;                                                // 0x0770(0x0018) Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected
		struct FAnimHumanLookAtData                                LookAtData;                                              // 0x0788(0x0448) Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstanceHumanFirearm
	 * Size -> 0x0018 (FullSize[0x0400] - InheritedSize[0x03E8])
	 */
	class UAnimInstanceHumanFirearm : public UAnimInstanceBase
	{
	public:
		class UHumanFirearmAnimCollection*                         WeaponAnimCollection;                                    // 0x03E8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UHumanFirearmAnimCollection*                         ZombieWeaponAnimCollection;                              // 0x03F0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FAnimHumanAimingData                                AimingData;                                              // 0x03F8(0x0001) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_QOQU[0x7];                                   // 0x03F9(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstancePlayer
	 * Size -> 0x0DD8 (FullSize[0x11C0] - InheritedSize[0x03E8])
	 */
	class UAnimInstancePlayer : public UAnimInstanceBase
	{
	public:
		struct FAnimLocomotionData                                 LocomotionData;                                          // 0x03E8(0x0098) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimPlayerWeaponData                               WeaponData;                                              // 0x0480(0x0048) Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_WLI3[0x8];                                   // 0x04C8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimPlayerCameraData                               CameraData;                                              // 0x04D0(0x0070) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimPlayerTransitionData                           TransitionData;                                          // 0x0540(0x0005) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_43PK[0x3];                                   // 0x0545(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimPlayerStateData                                StateData;                                               // 0x0548(0x0018) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimPlayerCollectionsData                          CollectionData;                                          // 0x0560(0x0590) Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected
		struct FAnimTwoHandsIKData                                 HandsIKData;                                             // 0x0AF0(0x0078) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FTwoLegIKData                                       LegsIKData;                                              // 0x0B68(0x01A8) Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected
		struct FAnimPlayerIdleSwayData                             IdleSwayData;                                            // 0x0D10(0x00E8) Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected
		struct FAnimPlayerClimbingData                             ClimbingData;                                            // 0x0DF8(0x00F0) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimPlayerWeaponSwingData                          WeaponSwingData;                                         // 0x0EE8(0x0080) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimPlayerWeaponInertiaData                        WeaponInertiaData;                                       // 0x0F68(0x0060) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimPlayerWeaponPushbackData                       WeaponPushbackData;                                      // 0x0FC8(0x0080) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimPlayerDetectorData                             DetectorData;                                            // 0x1048(0x0010) Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected
		struct FAnimHandItemData                                   HandItemData;                                            // 0x1058(0x0018) Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected
		struct FAnimPlayerMaterialData                             MaterialData;                                            // 0x1070(0x0008) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimPlayerLookAtData                               LookAtData;                                              // 0x1078(0x00B8) Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected
		struct FAnimPlayerAutoCoverData                            AutoCoverData;                                           // 0x1130(0x0048) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimHitData                                        HitData;                                                 // 0x1178(0x0048) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstancePlayerDetector
	 * Size -> 0x0008 (FullSize[0x03F0] - InheritedSize[0x03E8])
	 */
	class UAnimInstancePlayerDetector : public UAnimInstanceBase
	{
	public:
		class UPlayerDetectorAnimCollection*                       DetectorAnimCollection;                                  // 0x03E8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstancePlayerInjector
	 * Size -> 0x0018 (FullSize[0x0400] - InheritedSize[0x03E8])
	 */
	class UAnimInstancePlayerInjector : public UAnimInstanceBase
	{
	public:
		struct FInjectorAnimations                                 InjectorAnimations;                                      // 0x03E8(0x0010) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_FSEH[0x8];                                   // 0x03F8(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstancePlayerFirearm
	 * Size -> 0x0028 (FullSize[0x0410] - InheritedSize[0x03E8])
	 */
	class UAnimInstancePlayerFirearm : public UAnimInstanceBase
	{
	public:
		class UPlayerFirearmAnimCollection*                        WeaponAnimCollection;                                    // 0x03E8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FAnimPlayerAimingData                               AimingData;                                              // 0x03F0(0x0014) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FAnimPlayerFirearmData                              FirearmData;                                             // 0x0404(0x000C) BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstancePlayerThrowable
	 * Size -> 0x0008 (FullSize[0x03F0] - InheritedSize[0x03E8])
	 */
	class UAnimInstancePlayerThrowable : public UAnimInstanceBase
	{
	public:
		class UPlayerThrowableItemAnimCollection*                  WeaponAnimCollection;                                    // 0x03E8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstancePlayerKnife
	 * Size -> 0x0008 (FullSize[0x03F0] - InheritedSize[0x03E8])
	 */
	class UAnimInstancePlayerKnife : public UAnimInstanceBase
	{
	public:
		class UPlayerKnifeAnimCollection*                          WeaponAnimCollection;                                    // 0x03E8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstancePlayerPDA
	 * Size -> 0x0008 (FullSize[0x03F0] - InheritedSize[0x03E8])
	 */
	class UAnimInstancePlayerPDA : public UAnimInstanceBase
	{
	public:
		class UPlayerPDAAnimCollection*                            WeaponAnimCollection;                                    // 0x03E8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstanceItem
	 * Size -> 0x0008 (FullSize[0x03F0] - InheritedSize[0x03E8])
	 */
	class UAnimInstanceItem : public UAnimInstanceBase
	{
	public:
		class UItemAnimCollection*                                 ItemAnimCollection;                                      // 0x03E8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimInstancePlayerWeaponAttach
	 * Size -> 0x0018 (FullSize[0x0400] - InheritedSize[0x03E8])
	 */
	class UAnimInstancePlayerWeaponAttach : public UAnimInstanceBase
	{
	public:
		class UWeaponAttachAnimCollection*                         AttachAnimCollection;                                    // 0x03E8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FAnimPlayerFirearmData                              FirearmData;                                             // 0x03F0(0x000C) BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_O49H[0x4];                                   // 0x03FC(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotifyBase
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotifyBase : public UAnimNotify
	{
	public:
		ENotifyTriggerType                                         NotifyTriggerType;                                       // 0x0038(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_ZGMR[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotifyState_AgentEnableRootMotion
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_AgentEnableRootMotion : public UAnimNotifyState
	{
	public:
		EAgentRootMotionState                                      RootMotionMode;                                          // 0x0030(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_K1JL[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotifyState_ApplyDurationalEffectContextualAction
	 * Size -> 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_ApplyDurationalEffectContextualAction : public UAnimNotifyState
	{
	public:
		TArray<struct FModifyVFXValue>                             ModifyVFXAttachmentsValue;                               // 0x0030(0x0010) Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotifyState_LookAt
	 * Size -> 0x00E8 (FullSize[0x0118] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_LookAt : public UAnimNotifyState
	{
	public:
		EAttractionPointType                                       AttractionPointType;                                     // 0x0030(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bLookAtPlayer;                                           // 0x0031(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QJ7N[0x2];                                   // 0x0032(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                LookAtPlaceholderQuestGuid;                              // 0x0034(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                LookAtActorFName;                                        // 0x003C(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OWXY[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             TargetLocation;                                          // 0x0048(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                BoneName;                                                // 0x0060(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ReactionTime;                                            // 0x0068(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Priority;                                                // 0x006C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECollisionChannel                                          CollisionChannel;                                        // 0x0070(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EApplyRestrictionType                                      ApplyRestrictionType;                                    // 0x0071(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YF9J[0x6];                                   // 0x0072(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<ERotationPartType, struct FBodyPartRestriction>       HorizontalRestrictions;                                  // 0x0078(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn, NativeAccessSpecifierPublic
		TMap<ERotationPartType, struct FBodyPartRestriction>       VerticalRestrictions;                                    // 0x00C8(0x0050) Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotifyState_MotionAudioEnveloper
	 * Size -> 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
	 */
	class UAnimNotifyState_MotionAudioEnveloper : public UAnimNotifyState
	{
	public:
		class UAkAudioEvent*                                       PlayAkEvent;                                             // 0x0030(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       StopAkEvent;                                             // 0x0038(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAkRtpc*                                             MotionSpeedRTPC;                                         // 0x0040(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                BoneName;                                                // 0x0048(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinBoneVelocity;                                         // 0x0050(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxBoneVelocity;                                         // 0x0054(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    InterpolationTime;                                       // 0x0058(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShowBoneVelocityInfo;                                   // 0x005C(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PGZA[0x3];                                   // 0x005D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAkComponent*                                        AttachedAudioComponent;                                  // 0x0060(0x0008) ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_BCG9[0x28];                                  // 0x0068(0x0028) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotify_AIAnimationAction
	 * Size -> 0x0008 (FullSize[0x0048] - InheritedSize[0x0040])
	 */
	class UAnimNotify_AIAnimationAction : public UAnimNotifyBase
	{
	public:
		EAIAnimationAction                                         AnimationAction;                                         // 0x0040(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AJIO[0x7];                                   // 0x0041(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotify_AnyFootOnGround
	 * Size -> 0x0068 (FullSize[0x00A0] - InheritedSize[0x0038])
	 */
	class UAnimNotify_AnyFootOnGround : public UAnimNotify
	{
	public:
		EFootType                                                  Foot;                                                    // 0x0038(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_C47C[0x3];                                   // 0x0039(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                SocketName;                                              // 0x003C(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAttachedParticle;                                       // 0x0044(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QLG8[0x3];                                   // 0x0045(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             LocationOffset;                                          // 0x0048(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            RotationOffset;                                          // 0x0060(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FVector                                             Scale;                                                   // 0x0078(0x0018) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UNiagaraSystem*                                      DummyPreviewParticleSystem;                              // 0x0090(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShowPreviewDebugSphere;                                 // 0x0098(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DCBQ[0x7];                                   // 0x0099(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotify_AttachItem
	 * Size -> 0x0028 (FullSize[0x0068] - InheritedSize[0x0040])
	 */
	class UAnimNotify_AttachItem : public UAnimNotifyBase
	{
	public:
		EAttachAction                                              AttachAction;                                            // 0x0040(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EPBU[0x3];                                   // 0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                SocketName;                                              // 0x0044(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAttachType                                                AttachedItem;                                            // 0x004C(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WASH[0x3];                                   // 0x004D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              BindedAttachSid;                                         // 0x0050(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USkeletalMesh*                                       AttachMesh;                                              // 0x0060(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotify_AttachItemContextualAction
	 * Size -> 0x0010 (FullSize[0x0050] - InheritedSize[0x0040])
	 */
	class UAnimNotify_AttachItemContextualAction : public UAnimNotifyBase
	{
	public:
		TArray<struct FContextualItemAttachment>                   ContextualItemAttachments;                               // 0x0040(0x0010) Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotify_AttackHitDetection
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAnimNotify_AttackHitDetection : public UAnimNotifyState
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotify_ChangeWeaponIdle
	 * Size -> 0x0010 (FullSize[0x0050] - InheritedSize[0x0040])
	 */
	class UAnimNotify_ChangeWeaponIdle : public UAnimNotifyBase
	{
	public:
		EWeaponIdleState                                           WeaponIdle;                                              // 0x0040(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EShutterState                                              NewShutterState;                                         // 0x0041(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_T90X[0x2];                                   // 0x0042(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    NewJamIndex;                                             // 0x0044(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EWeaponIdleType                                            NewUnderbarrelState;                                     // 0x0048(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAnimationAimState                                         NewAimState;                                             // 0x0049(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EWeaponCustomAdditionalIdle                                AdditionalType;                                          // 0x004A(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0UW8[0x5];                                   // 0x004B(0x0005) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotify_ClimbingActions
	 * Size -> 0x0008 (FullSize[0x0048] - InheritedSize[0x0040])
	 */
	class UAnimNotify_ClimbingActions : public UAnimNotifyBase
	{
	public:
		EAnimationType                                             AnimationType;                                           // 0x0040(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QNOR[0x3];                                   // 0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      FocusCameraTime;                                         // 0x0044(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotify_CopyNiagaraValueFromAnotherContextualAction
	 * Size -> 0x0018 (FullSize[0x0058] - InheritedSize[0x0040])
	 */
	class UAnimNotify_CopyNiagaraValueFromAnotherContextualAction : public UAnimNotifyBase
	{
	public:
		struct FNiagaraValueCopyFromTo                             CopyFromTo;                                              // 0x0040(0x0018) Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotify_DetachItemContextualAction
	 * Size -> 0x0010 (FullSize[0x0050] - InheritedSize[0x0040])
	 */
	class UAnimNotify_DetachItemContextualAction : public UAnimNotifyBase
	{
	public:
		TArray<struct FContextualItemDetachment>                   ContextualItemAttachments;                               // 0x0040(0x0010) Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotify_GSCPlayMontageNotify
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_GSCPlayMontageNotify : public UAnimNotify
	{
	public:
		struct FGameplayTag                                        NotifyTag;                                               // 0x0038(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotify_GSCPlayMontageNotifyWindow
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class UAnimNotify_GSCPlayMontageNotifyWindow : public UAnimNotifyState
	{
	public:
		struct FGameplayTag                                        NotifyTag;                                               // 0x0030(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Stalker2.AnimNotify_HandIK
	 * Size -> 0x0018 (FullSize[0x0058] - InheritedSize[0x0040])
	 */
	class UAnimNotify_HandIK : public UAnimNotifyBase
	{
	public:
		EAnimationHands                                            HandToApply;                                             // 0x0040(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bForceSetStartValue;                                     // 0x0041(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
